[
  {
    "id": 1,
    "title": "Первая любовь в Хогвартсе",
    "author": "Мария Волшебникова",
    "genre": "фэнтези",
    "ageCategory": "12+",
    "tags": [
      "Хороший фанфик",
      "Романтика",
      "Приключения"
    ],
    "chapters": [
      {
        "id": 1,
        "title": "Глава 1: Новый ученик",
        "content": "Хогвартс встретил меня дождливым сентябрьским утром. Я, как и все первокурсники, с трепетом смотрела на величественный замок, который стал бы моим домом на ближайшие семь лет.\n\nБольшой зал был наполнен шёпотом и ожиданием. Свечи парили под потолком, создавая волшебную атмосферу. Я чувствовала, как сердце бьется чаще, когда профессор Макгонагалл начала зачитывать список новых учеников.\n\n— Поттер, Гарри! — раздался голос, и зал взорвался аплодисментами."
      },
      {
        "id": 2,
        "title": "Глава 2: Тайная комната",
        "content": "Прошло уже два месяца с начала учебного года. Я начала привыкать к ритму жизни в Хогвартсе, но чувство волшебства не покидало меня ни на минуту.\n\nОднажды после уроков зельеварения, возвращаясь в гриффиндорскую гостиную, я случайно свернула не в тот коридор. Стены здесь были украшены старинными гобеленами, изображавшими сцены из истории Хогвартса.\n\nВнезапно я заметила небольшую дверь, почти невидимую среди каменной кладки. Любопытство взяло верх, и я осторожно нажала на железную ручку."
      }
    ],
    "status": "approved",
    "createdAt": "2023-10-15T08:30:00.000Z"
  },
  {
    "id": 2,
    "title": "Тайны ночного города",
    "author": "Алекс Тёмный",
    "genre": "детектив",
    "ageCategory": "16+",
    "tags": [
      "Драма",
      "Детектив",
      "18+"
    ],
    "chapters": [
      {
        "id": 1,
        "title": "Пролог: Дождь и тайна",
        "content": "Дождь стучал по асфальту, отражая неоновые огни ночного города. Я стоял под козырьком старого здания, курил и наблюдал за тем, как по улице проезжали редкие машины.\n\nЭтот район никогда не спал. Здесь всегда что-то происходило — сделки в тени, обмен информацией, встречи, о которых никто не должен был знать. Я был частью этого мира, детективом, который знал город лучше, чем свои пять пальцев.\n\nВнезапно мой телефон завибрировал. Сообщение было коротким: «Угол 5-й и Мейн. Срочно. Будет кровь.»"
      }
    ],
    "status": "approved",
    "createdAt": "2023-10-20T14:45:00.000Z"
  }
]
